In [57]:
pip install --upgrade pip

Requirement already satisfied: pip in c:\users\rocpa\appdata\local\programs\python\python310\lib\site-packages (22.2.1)
Collecting pip
  Downloading pip-24.3.1-py3-none-any.whl (1.8 MB)
     ---------------------------------------- 1.8/1.8 MB 2.1 MB/s eta 0:00:00
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 22.2.1
    Uninstalling pip-22.2.1:
      Successfully uninstalled pip-22.2.1
Successfully installed pip-24.3.1
Note: you may need to restart the kernel to use updated packages.

  WARNING: The scripts pip.exe, pip3.10.exe and pip3.exe are installed in 'c:\Users\rocpa\AppData\Local\Programs\Python\Python310\Scripts' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.

In [61]:
# instalamos pandas
pip install pandas

SyntaxError: invalid syntax (1959049002.py, line 2)

In [66]:
# Importamos pandas y la base de datos
import pandas as pd
df = pd.read_csv('../data/Barcelona_Fotocasa_HousingPrices.csv')

In [1]:
import numpy as np

In [ ]:
# Revisamos primeras filas para ver si se ha importado el dataframe correctamente y para comprobar las primeras filas
df.head()

,Unnamed: 0,price,rooms,bathroom,lift,terrace,square_meters,real_state,neighborhood,square_meters_price
0,0,750,3,1,True,False,60,flat,Horta- Guinardo,12.500000
1,1,770,2,1,True,False,59,flat,Sant Andreu,13.050847
2,2,1300,1,1,True,True,30,flat,Gràcia,43.333333
3,3,2800,1,1,True,True,70,flat,Ciutat Vella,40.000000
4,4,720,2,1,True,False,44,flat,Sant Andreu,16.363636

In [ ]:
# Vemos cuantas filas y columnas contiene la tabla
df.shape

(8188, 10)

In [62]:
# Con esto podemos ver distintas estadisticas relacionadas con nuestros datos, como la mediana, la desviación estandar, el mínimo o el máximo
df.describe()

,Unnamed: 0,price,rooms,bathroom,square_meters,square_meters_price
count,8188.000000,8188.000000,8188.000000,8188.000000,8188.000000,8188.000000
mean,4093.500000,1444.092574,2.420738,1.508793,84.610161,17.739121
std,2363.816335,1125.886215,1.138592,0.732798,47.874028,9.245241
min,0.000000,320.000000,0.000000,1.000000,10.000000,4.910714
25%,2046.750000,875.000000,2.000000,1.000000,56.000000,12.790698
50%,4093.500000,1100.000000,2.000000,1.000000,73.000000,15.306122
75%,6140.250000,1540.000000,3.000000,2.000000,95.000000,19.444444
max,8187.000000,15000.000000,10.000000,8.000000,679.000000,186.666667

In [ ]:
# Esto nos proporciona información sobre las filas y columnas, tipos de dato y valores nulos
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8188 entries, 0 to 8187
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           8188 non-null   int64
 1   price                8188 non-null   int64
 2   rooms                8188 non-null   int64
 3   bathroom             8188 non-null   int64
 4   lift                 8188 non-null   bool
 5   terrace              8188 non-null   bool
 6   square_meters        8188 non-null   int64
 7   real_state           7920 non-null   object
 8   neighborhood         8188 non-null   object
 9   square_meters_price  8188 non-null   float64
dtypes: bool(2), float64(1), int64(5), object(2)
memory usage: 527.9+ KB

In [ ]:
# Veamos cuantos valores nulos hay por columna
df.isnull().sum()

Unnamed: 0               0
price                    0
rooms                    0
bathroom                 0
lift                     0
terrace                  0
square_meters            0
real_state             268
neighborhood             0
square_meters_price      0
dtype: int64

In [ ]:
# Tenemos 268 valores nulos en real_state, la cual es una columna con datos categóricos
df.real_state.unique()

array(['flat', 'attic', nan, 'apartment', 'study'], dtype=object)

In [68]:
# como no podemos asignarle una mediana de los demas valores de la columna, vamos a asignarle "unknown" a todas las columnas con valor nulo
df['real_state'].fillna('Unknown', inplace=True)

In [ ]:
# Veamos cuantos valores hay para cada valor de la columna 'real_state'
df['real_state'].value_counts()

real_state
flat         6505
apartment     991
attic         315
Unknown       268
study         109
Name: count, dtype: int64